иб/src/Catalogs/ХранилищеДанныхСправочники/ХранилищеДанныхСправочники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеДанныхСправочники</name>
  <attributes>
    <name>ДанныеХЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеПуть</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТекущаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

иб/src/Catalogs/ХранилищеДанныхСправочники/Forms/ФормаСпискаДополнительно/Module.bsl
// ПРОЦЕДУРЫ ФОРМЫ
//======================================================================================================
//======================================================================================================


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
 
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	

	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаЗагрузкиФайлов" Тогда
		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры


// ПРОЦЕДУРЫ ЭЛЕМЕНТОВ ФОРМЫ
//======================================================================================================
&НаКлиенте
Процедура ЗагрузитьФайлы(Команда)
	
	ПараметрыФормы = Новый Структура;
	Если ПараметрыФормы <> Неопределено Тогда
		ОткрытьФорму("ОбщаяФорма.ФормаЗагрузкиФайлов", ПараметрыФормы, ЭтаФОрма, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	АктивизироватьСтроку();
	
КонецПроцедуры


// ПРОЦЕДУРЫ ПРОЧИЕ
//======================================================================================================

Процедура АктивизироватьСтроку()
	
	Если ТекущийЭлемент.Имя = "Список" Тогда
		
		СтрокаСписка = ТекущийЭлемент.ТекущаяСтрока;
		Если СтрокаСписка <> Неопределено Тогда
			ДанныеАдрес = ПолучитьНавигационнуюСсылку(СтрокаСписка.Ссылка, "ДанныеХЗ");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	Для Каждого СтрокаФайл Из ВыбранноеЗначение Цикл 		
		Файл = Новый Файл(СтрокаФайл.Имя);
		ХранимыйФайл = Справочники.ХранилищеДанныхСправочники.СоздатьЭлемент();
		ХранимыйФайл.Наименование                      = Файл.Имя;
		ХранимыйФайл.ДанныеПуть                        = Файл.Путь;
		ХранимыйФайл.ДанныеТекущаяДата                 = ТекущаяДата();
		ХранимыйФайл.ДанныеХЗ = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СтрокаФайл.Хранение), Новый СжатиеДанных());
 		ХранимыйФайл.Записать();
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

//======================================================================================================
